CSI API ETABS v1
cView.RefreshView Method
 Refreshes the view for the specified window(s).
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int RefreshView(
	int Window = 0,
	bool Zoom = true
)
Function RefreshView (
	Optional Window As Integer = 0,
	Optional Zoom As Boolean = true
) As Integer
Dim instance As cView
Dim Window As Integer
Dim Zoom As Boolean
Dim returnValue As Integer
returnValue = instance.RefreshView(Window,
	Zoom)
int RefreshView(
	int Window = 0,
	bool Zoom = true
)
abstract RefreshView :
        ?Window : int *
        ?Zoom : bool
(* Defaults:
        let _Window = defaultArg Window 0
        let _Zoom = defaultArg Zoom true
*)
-> int
Parameters
Window (Optional)
Type: System.Int32
This is 0 meaning all windows or an existing window number. It indicates the window(s) to have its view refreshed.
Zoom (Optional)
Type: System.Boolean
If this item is True, the window zoom is maintained when the view is refreshed. If it is False, the zoom returns to a default zoom.
Return Value
Type: Int32
Returns zero if the window views are successfully refreshed; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'refresh view
       ret = SapModel.View.RefreshView()
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cView Interface
ETABSv1 Namespace